{
  "kind": "build_request",
  "title": "Update Valentine page: force Yes via button resizing and personalize success message for Naina",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Update the prompt actions so the two options are labeled exactly “Yes” and “No” (no extra words or emojis in the labels).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user"
        ],
        "quotes": [
          "There should be two options: Yes or No."
        ]
      },
      "acceptanceCriteria": [
        "On the prompt screen, the primary action button text reads exactly “Yes”.",
        "On the prompt screen, the secondary action button text reads exactly “No”."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Change the “No” interaction behavior so that when the user hovers (pointer enter) over “No”, the “No” button visually shrinks and the “Yes” button visually grows, making it difficult to click “No”; on iPad (no hover), apply the same effect on pointer down/tap on “No”. Preserve the existing behavior where repeated “No” interactions can still hide “No” after the third interaction so it cannot be clicked.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user"
        ],
        "quotes": [
          "When she hovers her cursor over No, it should getting small and yes option will get big so she cannot click on no option , forcing her to click only on Yes."
        ]
      },
      "acceptanceCriteria": [
        "On desktop, moving the cursor onto the “No” button causes “No” to shrink and “Yes” to enlarge with a smooth transition.",
        "On iPad Chrome, tapping/pressing on “No” triggers the same shrink/grow effect (without requiring hover).",
        "After the third “No” interaction (hover/pointer enter or pointer down), the “No” option is removed/hidden and can no longer be clicked.",
        "The “Yes” button remains clickable throughout and continues to transition to the success screen when tapped/clicked."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Update the success screen user-facing text to exactly match the user’s provided wording for Naina, including punctuation, capitalization, emojis, and line breaks. The success heading must be exactly: “Good choice me is ❤️”. The body must be exactly the provided paragraph followed by the closing line “I love you so much naina”.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user"
        ],
        "quotes": [
          "When she clicks Yes, show her a meme image telling her “Good choice me is ❤️\n\nNaina, I just want to thank you from the bottom of my heart for choosing me as your life partner. It means more to me than words can truly explain. Your trust, your love, and the way you stand by me make my world brighter every single day. I promise to always respect you, support your dreams, and keep trying to become the person you deserve. With you, life feels more beautiful, more peaceful, and full of hope. I’m truly grateful to have you in my life, today and always. ❤️”.\nI love you so much naina"
        ]
      },
      "acceptanceCriteria": [
        "After clicking/tapping “Yes”, the success heading text is exactly: “Good choice me is ❤️”.",
        "The success message body includes the exact text addressed to “Naina,” as provided by the user, preserving the curly apostrophe in “I’m”, the ❤️ emoji, and the closing quote/period as given.",
        "The final line on the success screen reads exactly: “I love you so much naina”."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (compose them as-is).",
    "Do not edit files in frontend immutablePaths (authentication hooks and main bootstrap files).",
    "Keep the backend as a single Motoko actor; no backend changes are required for these UI-only updates."
  ],
  "nonGoals": [
    "Adding sound effects or background music.",
    "Adding backend persistence, user accounts, or analytics.",
    "Changing the pink/white romantic theme beyond what is needed to support the new button-resize interaction."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}